var myMap = new Map();
myMap.set("Механизированная разработка грунта и шурфовка на наличие существующих сетей", ["Обратная засыпка грунтом мест шурфовок"]);
myMap.set("Механизированная разработка грунта", ["Устройство песчаного основания под трубопровод", "Устройство песчаного основания под колодец", "Бестраншейная прокладка методом ГНБ полиэтиленового трубопровода", "Бестраншейная прокладка полиэтиленового трубопровода с протаскиванием в футляр методом ГНБ", "Бестраншейная прокладка методом ГНБ стального трубопровода", "Бестраншейная прокладка стального трубопровода с протаскиванием в футляр методом ГНБ"]);
myMap.set("Устройство песчаного основания под трубопровод", ["Укладка трубопровода на песчаное основание"]);
myMap.set("Устройство песчаного основания под колодец", ["Монтаж днища и рабочей части сборного железобетонного колодца"]);
myMap.set("Обратная засыпка грунтом мест шурфовок", ["Механизированная разработка грунта"]);
myMap.set("Обратная засыпка грунтом", ["---"]);
myMap.set("Устройство над трубопроводом защитного слоя из песка и обратная засыпка грунтом", ["Проведение гидравлического испытания напорного трубопровода на прочность и герметичность", "Проведение промывки и гидравлического испытания напорного трубопровода на прочность и герметичность"]);
myMap.set("Сварка полиэтиленового трубопровода в плеть", ["Бестраншейная прокладка методом ГНБ полиэтиленового трубопровода", "Бестраншейная прокладка полиэтиленового трубопровода с протаскиванием в футляр методом ГНБ"]);
myMap.set("Сварка полиэтиленового трубопровода и фасонных частей", ["Подбивка песком полиэтиленового трубопровода"]);
myMap.set("Сварка трубопровода с помощью электромуфты", ["Подбивка песком полиэтиленового трубопровода", "Устройство над трубопроводом защитного слоя из песка и обратная засыпка грунтом"]);
myMap.set("Сварка и укладка на песчаное основание полиэтиленового трубопровода с фасонными частями", ["Подбивка песком полиэтиленового трубопровода", "Устройство над трубопроводом защитного слоя из песка и обратная засыпка грунтом"]);
myMap.set("Сварка стального трубопровода в плеть", ["Бестраншейная прокладка методом ГНБ стального трубопровода", "Бестраншейная прокладка стального трубопровода с протаскиванием в футляр методом ГНБ"]);
myMap.set("Сварка стального трубопровода и фасонных частей", ["Подбивка песком стального трубопровода", "Нанесение антикоррозийной изоляции лентами поливинилхлоридными липкими в три слоя по слою праймера битумного на стальной трубопровод"]);
myMap.set("Сварка и укладка на песчаное основание стального трубопровода с фасонными частями", ["Подбивка песком стального трубопровода", "Устройство над трубопроводом защитного слоя из песка и обратная засыпка грунтом"]);
myMap.set("Сварка полиэтиленового трубопровода и фасонных частей, монтаж запорной арматуры в колодце", ["Проведение гидравлического испытания напорного трубопровода на прочность и герметичность", "Проведение промывки и гидравлического испытания напорного трубопровода на прочность и герметичность"]);
myMap.set("Сварка полиэтиленового трубопровода и фасонных частей, монтаж пожарного гидранта в колодце", ["Проведение гидравлического испытания напорного трубопровода на прочность и герметичность", "Проведение промывки и гидравлического испытания напорного трубопровода на прочность и герметичность"]);
myMap.set("Сварка стального трубопровода и фасонных частей, монтаж запорной арматуры в колодце", ["Нанесение антикоррозионной изоляции эмалью в два слоя по слою грунтовки на стальные поверхности трубопровода и фасонных частей в колодце"]);
myMap.set("Сварка стального трубопровода и фасонных частей, монтаж пожарного гидранта в колодце", ["Нанесение антикоррозионной изоляции эмалью в два слоя по слою грунтовки на стальные поверхности трубопровода и фасонных частей в колодце"]);
myMap.set("Устройство врезки в существующий полиэтиленовый трубопровод", ["Проведение гидравлического испытания напорного трубопровода на прочность и герметичность", "Проведение промывки и гидравлического испытания напорного трубопровода на прочность и герметичность"]);
myMap.set("Устройство врезки в существующий стальной трубопровод", ["Нанесение антикоррозионной изоляции эмалью в два слоя по слою грунтовки на стальные поверхности трубопровода"]);
myMap.set("Монтаж колонок управления задвижками", ["---"]);
myMap.set("Бестраншейная прокладка методом ГНБ полиэтиленового трубопровода", ["Монтаж полиэтиленовых фасонных частей трубопровода"]);
myMap.set("Бестраншейная прокладка полиэтиленового трубопровода с протаскиванием в футляр методом ГНБ", ["Заделка концов футляра"]);
myMap.set("Бестраншейная прокладка методом ГНБ стального трубопровода", ["Монтаж стальных фасонных частей трубопровода"]);
myMap.set("Бестраншейная прокладка стального трубопровода с протаскиванием в футляр методом ГНБ", ["Заделка концов футляра"]);
myMap.set("Заделка концов футляра", ["Обратная засыпка концов футляра"]);
myMap.set("Монтаж днища и рабочей части сборного железобетонного колодца", ["Монтаж плиты перекрытия и горловины сборного железобетонного колодца"]);
myMap.set("Монтаж плиты перекрытия и горловины сборного железобетонного колодца", ["Устройство оклеечной гидроизоляции наружной поверхности колодца, а также мест стыковок железобетонных элементов колодца"]);
myMap.set("Монтаж стремянок", ["---"]);
myMap.set("Монтаж опор под пожарные гидранты", ["---", "Монтаж пожарного гидранта в колодце"]);
myMap.set("Демонтаж", ["---"]);
myMap.set("Устройство оклеечной гидроизоляции стеклоизолом в два слоя по слою праймера битумного наружной поверхности колодца, а также мест стыковок железобетонных элементов колодца", ["Обратная засыпка пазух колодца"]);
myMap.set("Герметизация мест прохода полиэтиленового трубопровода через стенки колодца", ["Обратная засыпка пазух колодца"]);
myMap.set("Герметизация мест прохода стального через стенки колодца", ["Обратная засыпка пазух колодца"]);
myMap.set("Подготовка под изоляцию (очистка, обеспыливание, обезжиривание) металлических поверхностей", ["Огрунтовка металлических поверхностей"]);
myMap.set("Огрунтовка за один раз металлических поверхностей", ["Окраска металлических огрунтованных поверхностей"]);
myMap.set("Окраска в два слоя металлических огрунтованных поверхностей", ["---"]);
myMap.set("Нанесение антикоррозионной изоляции лентами поливинилхлоридными липкими в три слоя по слою праймера битумного на стальной трубопровод", ["Устройство над трубопроводом защитного слоя из песка и обратная засыпка грунтом", "Обратная засыпка грунтом"]);

function addSelect() {
    var select1Text = document.getElementById('work1').value;
    var select2 = document.getElementById('work2');

    select2.innerHTML = '';

    var arrayOption = myMap.get(select1Text);
    arrayOption.forEach(function(el) {
        var optionAdd = document.createElement('option');
        optionAdd.text = el;
        select2.appendChild(optionAdd);
    });
}

document.addEventListener("DOMContentLoaded", function(event) {
    addSelect();
    countProjects();
    updateDrawings();
});

function updateDrawings() {
    var projectSection = document.getElementById("projectSectionSelect").value;
    var drawingsList1 = document.querySelectorAll('div[id="drawingsList1"]');
        var drawingsList2 = document.querySelectorAll('div[id="drawingsList2"]');

    var option1 = document.querySelector("#projectSectionSelect option:first-child");
    var option2 = document.querySelector("#projectSectionSelect option:last-child");

    drawingsList1.forEach((drawing) => {
        drawing.style.display = (projectSection === option1.value) ? "block" : "none";
    });
    drawingsList2.forEach((drawing) => {
        drawing.style.display = (projectSection === option2.value) ? "block" : "none";
    });
}

function countProjects() {
    var countProjects = document.getElementById("countProjectsSelect").value;
    var drawingsList1 = document.querySelectorAll('div[id="drawingsList1"]');
    var drawingsList2 = document.querySelectorAll('div[id="drawingsList2"]')
    var firstProjectSection = document.getElementById("firstProjectSection");
    var secondProjectSection = document.getElementById("secondProjectSection");
    var projectSectionSelect = document.getElementById("projectSectionSelect");
    if (countProjects == "1") {
        firstProjectSection.setAttribute("hidden", "");
        secondProjectSection.setAttribute("hidden", "");

        drawingsList1.forEach((drawing) => {
            drawing.style.display = "none";
        });
        drawingsList2.forEach((drawing) => {
            drawing.style.display = "none";
        });

        projectSectionSelect.removeAttribute("hidden");
    } else {
        projectSectionSelect.setAttribute("hidden", "");

        firstProjectSection.removeAttribute("hidden");
        secondProjectSection.removeAttribute("hidden");

        drawingsList1.forEach((drawing) => {
            drawing.style.display = "block";
        });
        drawingsList2.forEach((drawing) => {
            drawing.style.display = "block";
        });
    }
}

function removeMaterial(button) {
    var parentDiv = button.parentElement;
    if (parentDiv) {
        parentDiv.remove();
    }
}